tap "aymanbagabas/tap"
tap "fluxcd/tap"
tap "homebrew/bundle"

brew "age"
brew "atuin"
brew "bash"
brew "bat"
brew "chezmoi"
brew "coreutils"
brew "curl"
brew "docker"
brew "docker-compose"
brew "doggo"
brew "eza"
brew "findutils"
brew "fish"
brew "fzf"
brew "gawk"
brew "gh"
brew "git"
brew "gnu-sed"
brew "go-task"
brew "gum"
brew "helm"
brew "helmfile"
brew "helm-docs"
brew "helm-ls"
brew "jq"
brew "k9s"
brew "kubernetes-cli"
brew "krew"
brew "kubecm"
brew "kubecolor"
brew "kustomize"
brew "lazygit"
brew "mas"
brew "minijinja-cli"
brew "mise"
brew "neovim"
brew "pinentry-mac"
brew "shellcheck"
brew "sops"
brew "starship"
brew "stern"
brew "talhelper"
brew "talosctl"
brew "telnet"
brew "wget"
brew "yamllint"
brew "yamlfmt"
brew "yq"
brew "zoxide"
brew "aymanbagabas/tap/shcopy"
brew "fluxcd/tap/flux"
brew "goreleaser/tap/goreleaser"

cask "1password"
cask "1password-cli"
cask "acorn"
cask "beyond-compare"
cask "corelocationcli"
cask "discord"
cask "font-monaspace-nerd-font"
cask "gifox"
cask "ghostty"
cask "google-chrome"
cask "goreleaser"
cask "jordanbaird-ice"
cask "karabiner-elements"
cask "keyboard-maestro"
cask "little-snitch"
cask "maccy"
cask "microsoft-auto-update"
cask "obsidian"
cask "orbstack"
cask "obsidian"
cask "raycast"
cask "rectangle-pro"
cask "shottr"
cask "signal"
cask "swiftbar"
cask "slack"
cask "tableplus"
cask "visual-studio-code"
cask "vmware-fusion"
cask "wireshark"

mas "1Password for Safari", id: 1569813296
mas "AdGuard for Safari", id: 1440147259
mas "Caffeinated", id: 1362171212
mas "Kagi for Safari", id:1622835804
mas "Keka", id: 470158793
mas "MQTT Explorer", id: 1455214828
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Passepartout", id: 1433648537
mas "ReadKit", id: 1615798039
mas "Sink It for Reddit", id: 6449873635
mas "StopTheMadness Pro", id: 6471380298
mas "UniFi Identity Endpoint", id: 6450954172

vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "bluebrown.yamlfmt"
vscode "esbenp.prettier-vscode"
vscode "fnando.linter"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "helm-ls.helm-ls"
vscode "ionutvmi.path-autocomplete"
vscode "jinliming2.vscode-go-template"
vscode "luisfontes19.vscode-swissknife"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "orta.vscode-jest"
vscode "redhat.vscode-yaml"
vscode "samuelcolvin.jinjahtml"
vscode "savh.json5-kit"
vscode "signageos.signageos-vscode-sops"
vscode "tamasfe.even-better-toml"

{{ if (not .isWorkComputer) }}
cask "android-platform-tools"
cask "anylist"
cask "autodesk-fusion"
cask "calibre"
cask "halloy"
cask "openscad@snapshot"

mas "Labelife", id: 1560922539
mas "Windows App", id: 1295203466
{{ else }}
brew "kyverno"

cask "citrix-workspace"
{{ end }}
